woddu/ESP32S3-Hydroponics/src/hydroponics.h
#include <Arduino.h>
#include <Time.h>
#include <Preferences.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <ESP32Servo.h>
#include <Adafruit_ADS1X15.h>
#include <Adafruit_VL53L0X.h>
#include <Adafruit_Sensor.h>
#include <DHT.h>
#include <DHT_U.h>
#include "tft.h"
#include "tds.h"
#include "phsensor.h"
#include "pins.h"
#include "datetime.h"


#define LOG_DRAINING_STOP       "Log12"
#define DHTTYPE    DHT22

BLECharacteristic *pNotifyLogs = NULL;

TaskHandle_t xTFTLeftPanelHandle = NULL;
TaskHandle_t xTFTChildPanelHandle = NULL;
SemaphoreHandle_t xTFTPrintMutex;
SemaphoreHandle_t xADSMutex;

Adafruit_ADS1015 ads;

// Adafruit_ADS1015 LDRs;

Adafruit_VL53L0X lox = Adafruit_VL53L0X();

VL53L0X_RangingMeasurementData_t measure;

Preferences pref;

Servo servo;

DHT_Unified dht(DHT22_PIN, DHTTYPE);

int16_t ads2, ads3;
float volt2, volt3;

static bool startAttempt;
static bool pauseAttempt;
static bool drainAttempt;
static bool hasWater;
static bool prepared;
static bool started;
static bool paused;
static bool draining;
static bool reading;

bool waterPumpState, airPumpState, drainPumpState, servoState, growLightState, humidifierState;

float dhtTemp, dhtHumid;

static bool phRead;

int lightTreshold;

int waterLevel;

static int prevLightHour = 18;
static int lightHour = 18;

static int prevDarkHour = 6;
static int darkHour = 6;

int lightDarkCounter;

bool countingLight = true;

bool Starting(){
  return startAttempt && !prepared && !started;
}

bool Pausing(){
  return pauseAttempt && started;
}

bool Resuming(){
  return startAttempt && started;
}

bool Prepared(){
  return !startAttempt && prepared && !started;
}

bool Started(){
  return started && prepared && !paused;
}

bool Paused(){
  return started && paused;
}

bool Draining(){
  return draining;
}

bool NotRunning(){
  return !started && !paused && !prepared;
}

unsigned long LightHour(){
  return (unsigned long)lightHour * HOUR;
}

unsigned long DarkHour(){
  return (unsigned long)darkHour * HOUR;
}


void TFTPrint(int x, int y, String print, uint16_t color = onSurfaceVariant, int size = 1){
  tft.setTextColor(color);
  tft.setTextSize(size);
  tft.getTextBounds(print, 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
  if ((print.indexOf('g') != -1) || (print.indexOf('y') != -1)){
    tft.setCursor(x, y + hBuf - (size == 1 ? 4 : 12));
  } else if((print.indexOf('q') != -1) || (print.indexOf('Q') != -1) || (print.indexOf('p') != -1)){
    tft.setCursor(x, y + hBuf - (size == 1 ? 3 : 9));
  } else {
    tft.setCursor(x, y + hBuf);
  }
  tft.print(print);
}

void RectWithCenteredText(
  bool fill, int16_t rectX, int16_t rectY, int16_t rectWidth, int16_t rectHeight, uint16_t rectColor, 
  String print, uint16_t color = onPrimaryContainer, int size = 1, int16_t margin = 0
){
  tft.setTextSize(size);

  tft.getTextBounds(print, 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
  
  if (wBuf > rectWidth) {
      rectWidth = wBuf + margin;
  }
  if (hBuf > rectHeight) {
      rectHeight = hBuf + margin;
  }
  
  if (fill){
    tft.fillRect(rectX, rectY, rectWidth, rectHeight, rectColor);
  } else {
    tft.drawRect(rectX, rectY, rectWidth, rectHeight, rectColor);
  }

  int16_t textX = rectX + ((rectWidth - wBuf) / 2);
  int16_t textY = rectY + ((rectHeight - hBuf) / 2);

  // Serial.printf("x: %d, y: %d, wBuf: %d, hBuf: %d \n", textX, textY, wBuf, hBuf);

  TFTPrint(textX - 2, textY - 2, print, color, size);
}

bool ScreenChanged(){
  if(GUI.screenChanged){
    GUI.screenChanged = !GUI.screenChanged;
    return !GUI.screenChanged;
  } else {
    return GUI.screenChanged;
  }
}

void TFTLeftPanel(void * param){
  uint32_t ulNotificationValue;

  while(1){
    if (xTaskNotifyWait(0, 0xFFFFFFFF, &ulNotificationValue, portMAX_DELAY) == pdTRUE) {
      if(xSemaphoreTake(xTFTPrintMutex, portMAX_DELAY) == pdTRUE){
        Serial0.println("Notification Received!");
        
        tft.fillRect(0,60, 80, (180), surfaceVariant);
        switch (GUI.leftPanelSelectionY){
          case 0:
          RectWithCenteredText(true, 0, 60, 80, 37, secondary, "Actions", 0xFFFF);
          RectWithCenteredText(true, 0, 97, 80, 37, surfaceVariant, "Light", onSurfaceVariant);
          RectWithCenteredText(true, 0, (134), 80, 37, surfaceVariant, "Sensor", onSurfaceVariant);
          RectWithCenteredText(true, 0, (171), 80, 37, surfaceVariant, "Pump..", onSurfaceVariant);
          break;
        case 1:
          RectWithCenteredText(true, 0, 60, 80, 37, surfaceVariant, "Actions", onSurfaceVariant);
          RectWithCenteredText(true, 0, 97, 80, 37, secondary, "Light", 0xFFFF);
          RectWithCenteredText(true, 0, (134), 80, 37, surfaceVariant, "Sensor", onSurfaceVariant);
          RectWithCenteredText(true, 0, (171), 80, 37, surfaceVariant, "Pump..", onSurfaceVariant);
          break;
        case 2:
          RectWithCenteredText(true, 0, 60, 80, 37, surfaceVariant, "Actions", onSurfaceVariant);
          RectWithCenteredText(true, 0, 97, 80, 37, surfaceVariant, "Light", onSurfaceVariant);
          RectWithCenteredText(true, 0, (134), 80, 37, secondary, "Sensor", 0xFFFF);
          RectWithCenteredText(true, 0, (171), 80, 37, surfaceVariant, "Pump..", onSurfaceVariant);
          break;
        case 3:
          RectWithCenteredText(true, 0, 60, 80, 37, surfaceVariant, "Actions", onSurfaceVariant);
          RectWithCenteredText(true, 0, 97, 80, 37, surfaceVariant, "Light", onSurfaceVariant);
          RectWithCenteredText(true, 0, (134), 80, 37, surfaceVariant, "Sensor", onSurfaceVariant);
          RectWithCenteredText(true, 0, (171), 80, 37, secondary, "Pump..", 0xFFFF);
          break;
        default:
          break;
        }
        xSemaphoreGive(xTFTPrintMutex);
      }
    }
    vTaskDelay(10 / portTICK_PERIOD_MS);
  }
}
int ChildPanelX(int x){ return x + 80; }
int ChildPanelY(int y){ return y + 60; }
void TFTChildPanel(void * param){
  uint32_t ulNotificationValue;
  
  const int childPanelWidth = 240, childPanelHeight = 180;

  int randNum;

  String sampleStr;
  sampleStr.reserve(50);
  
  TFTPrint(ChildPanelX(12), ChildPanelY(94), "Date:", onSurface);
  TFTPrint(ChildPanelX(12), ChildPanelY(128), "Water Level:", onSurface);

  while(1){
    randNum = random(25, 35);

