woddu/ESP32S3-Hydroponics/src/hydroponics.h
    if(xSemaphoreTake(xTFTPrintMutex, portMAX_DELAY) == pdTRUE){
      if (ScreenChanged()){
        tft.fillRect(80,60, childPanelWidth, childPanelHeight, surface);
        if (AtMainScreen()){
          TFTPrint(ChildPanelX(12), ChildPanelY(94), "Date:", onSurface);
          TFTPrint(ChildPanelX(12), ChildPanelY(128), "Water Level:", onSurface);
        } else if (AtActionScreen()){
          
        } else if(AtLightScreen()){
          tft.setFont(&FreeSans18pt7b);
          TFTPrint(ChildPanelX((childPanelWidth / 4) - 40), ChildPanelY(6), "Light", onSurface);
          TFTPrint(ChildPanelX((childPanelWidth / 4 * 3) - 40), ChildPanelY(10), "Dark", onSurface);
          TFTPrint(ChildPanelX((childPanelWidth / 4) - 40), ChildPanelY(childPanelHeight / 2) + 48 , "Hour", onSurface);
          TFTPrint(ChildPanelX((childPanelWidth / 4 * 3) - 40), ChildPanelY(childPanelHeight / 2) + 48 , "Hour", onSurface);
          tft.setFont(&FreeSans12pt7b);

          tft.fillTriangle(ChildPanelX(childPanelWidth / 2), ChildPanelY(childPanelHeight / 2) - 16, ChildPanelX(childPanelWidth / 2) - 8, ChildPanelY(childPanelHeight / 2) - 4, ChildPanelX(childPanelWidth / 2) + 8, ChildPanelY(childPanelHeight / 2) - 4, primary);
          tft.fillTriangle(ChildPanelX(childPanelWidth / 2), ChildPanelY(childPanelHeight / 2) + 16, ChildPanelX(childPanelWidth / 2) - 8, ChildPanelY(childPanelHeight / 2) + 4, ChildPanelX(childPanelWidth / 2) + 8, ChildPanelY(childPanelHeight / 2) + 4, primary);

        } else if (AtSensorScreen()){
          tft.fillRect(0,60, (320), (180), surface);
          
          TFTPrint((320 / 12 * 2) - 40, ChildPanelY((childPanelHeight / 4 )) - 24, "pH: ", onSurface);Serial0.printf("y: %d", tft.getCursorY());
          TFTPrint((320 / 12 * 2) - 40, ChildPanelY((childPanelHeight / 4 * 2)) - 24, "Water: ", onSurface);Serial0.printf("y: %d", tft.getCursorY());
          TFTPrint((320 / 12 * 2) - 40, ChildPanelY((childPanelHeight / 4 * 3)) - 24, "Temp: ", onSurface);Serial0.printf("y: %d", tft.getCursorY());
            
          TFTPrint((320 / 12 * 8) - 70, ChildPanelY((childPanelHeight / 4 )) - 24, "TDS: ", onSurface);Serial0.printf("y: %d", tft.getCursorY());
          TFTPrint((320 / 12 * 8) - 40, ChildPanelY((childPanelHeight / 4 * 2)) - 24, "Humid: ", onSurface);Serial0.printf("y: %d\n", tft.getCursorY());

          tft.fillRect(0, 203, 320, 37, surfaceVariant);
          TFTPrint((320 - 73) / 2, 212, "Sensors");
          tft.fillTriangle(6, (203 + (37 / 2)), 24, 209, 24, 234, secondary);
        } else if (AtPumpScreen()){
          tft.fillRect(0,60, (320), (180), surface);
          TFTPrint((320 / 12 * 2) - 40, ChildPanelY((childPanelHeight / 4 )) - 24, "Water: ", onSurface);Serial0.printf("y: %d", tft.getCursorX());
          TFTPrint((320 / 12 * 2) - 40, ChildPanelY((childPanelHeight / 4 * 2)) - 24, "Drain: ", onSurface);Serial0.printf("y: %d", tft.getCursorX());
          TFTPrint((320 / 12 * 2) - 40, ChildPanelY((childPanelHeight / 4 * 3)) - 24, "Servo: ", onSurface);Serial0.printf("y: %d", tft.getCursorX());

          TFTPrint((320 / 12 * 8) - 40, ChildPanelY((childPanelHeight / 4 )) - 24, "Air: ", onSurface);Serial0.printf("y: %d", tft.getCursorX());
          TFTPrint((320 / 12 * 8) - 40, ChildPanelY((childPanelHeight / 4 * 2)) - 24, "LED: ", onSurface);Serial0.printf("y: %d", tft.getCursorX());
          TFTPrint((320 / 12 * 8) - 40, ChildPanelY((childPanelHeight / 4 * 3)) - 24, "Humid: ", onSurface);Serial0.printf("y: %d\n", tft.getCursorX());

          tft.fillRect(0, 203, 320, 37, surfaceVariant);
          TFTPrint((320 - 147) / 2, 210, "Pumps & etc...");
          tft.fillTriangle(6, (203 + (37 / 2)), 24, 209, 24, 234, secondary);
        }
      }

      if (AtMainScreen()){
        vTaskDelay(10/ portTICK_PERIOD_MS);
        tft.setFont(&FreeSans18pt7b);
        if (Starting()){
          if(phRead == 1){
            tft.getTextBounds("Reading", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
            // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
            TFTPrint(ChildPanelX(61), ChildPanelY(14), "Reading", onSurface);  
          } else if(phRead == 2){
            tft.getTextBounds("Low pH", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
            // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
            TFTPrint(ChildPanelX(61), ChildPanelY(14), "Low pH", onSurface);  
          } else if(phRead == 3){
            tft.getTextBounds("High pH", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
            // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
            TFTPrint(ChildPanelX(61), ChildPanelY(14), "High pH", onSurface);  
          } else if(phRead == 0){
            tft.getTextBounds("Starting", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
            // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
            TFTPrint(ChildPanelX(61), ChildPanelY(14), "Starting", onSurface);  
          }
        } else if (Started()){
          tft.getTextBounds("Running", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
          // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
          TFTPrint(ChildPanelX(58), ChildPanelY(14), "Running", onSurface);  
        } else if (Paused()){
          tft.getTextBounds("Paused", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
          // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
          TFTPrint(ChildPanelX(64), ChildPanelY(14), "Paused", onSurface);  
        } else if (Draining()){
          tft.getTextBounds("Draining", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
          // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
          TFTPrint(ChildPanelX(64), ChildPanelY(14), "Draining", onSurface);  
        } else if(NotRunning()){
          if(phRead == 2){
            tft.getTextBounds("Low pH", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
            // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
            TFTPrint(ChildPanelX(61), ChildPanelY(14), "Low pH", onSurface);  
          } else if(phRead == 3){
            tft.getTextBounds("High pH", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
            // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
            TFTPrint(ChildPanelX(61), ChildPanelY(14), "High pH", onSurface);  
          } else if(phRead == 0 || phRead == 1){
            tft.getTextBounds("Not Running", 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
            // Serial0.printf("x: %d\n", (childPanelWidth - wBuf) / 2);
            TFTPrint(ChildPanelX(22), ChildPanelY(14), "Not Running", onSurface);  
          }
        }
        tft.setFont(&FreeSans12pt7b);
        time_t runTime = runtimeTimeStamp;
        struct tm *timeInfo = localtime(&runTime); // Convert to time structure

