woddu/ESP32S3-Hydroponics/src/hydroponics.h
        char timeString[9];
        sprintf(timeString, "%02d:%02d:%02d", timeInfo->tm_hour, timeInfo->tm_min, timeInfo->tm_sec);
        tft.getTextBounds(timeString, 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
        RectWithCenteredText(true, ChildPanelX((childPanelWidth - wBuf) / 2), ChildPanelY((childPanelHeight - hBuf) / 10 * 4), 2, 2, surface, timeString, onSurface, 1, 5);

        time_t rawTime = time(nullptr); // Get current time in seconds
        struct tm *timeInfo1 = localtime(&rawTime); // Convert to time structure

        char dateString[9]; // MM/dd/YY format
        sprintf(dateString, "%02d/%02d/%02d", timeInfo1->tm_mon + 1, timeInfo1->tm_mday, timeInfo1->tm_year % 100);
        RectWithCenteredText(true, ChildPanelX(76), ChildPanelY((childPanelHeight - hBuf) / 10 * 6), 2, 2, surface, dateString, onSurface);
        
        tft.fillRect(ChildPanelX(152), ChildPanelY((childPanelHeight - hBuf) / 10 * 8), 100, 70, surface);
        if(waterLevel >= 0 && waterLevel <= 33){
          RectWithCenteredText(true, ChildPanelX(156), ChildPanelY((childPanelHeight - hBuf) / 10 * 8), 2, 2, surface, "Low", onSurface, 1, 4);
        } else if(waterLevel >= 34 && waterLevel < 66){
          RectWithCenteredText(true, ChildPanelX(156), ChildPanelY((childPanelHeight - hBuf) / 10 * 8), 2, 2, surface, "Medium", onSurface, 1, 4);
        } else if(waterLevel >= 67){
          RectWithCenteredText(true, ChildPanelX(156), ChildPanelY((childPanelHeight - hBuf) / 10 * 8), 2, 2, surface, "High", onSurface, 1, 4);
        }
      
        
      } else if (AtActionScreen()){
        tft.setFont(&FreeSans18pt7b);
        
        if(Started()){
            TFTPrint(164, ChildPanelY(26), "Start", surfaceVariant);
            TFTPrint(154, ChildPanelY(78), "Pause", primary);
          } else if (Paused() || NotRunning()) {
            TFTPrint(164, ChildPanelY(26), "Start", primary);
            TFTPrint(154, ChildPanelY(78), "Pause", surfaceVariant);
          }
        TFTPrint(160, ChildPanelY(130), "Drain", primary);
        if (GUI.actionSelectionY == 0){
          
          if(Started()){
            TFTPrint(164, ChildPanelY(26), "Start", surfaceVariant);
            TFTPrint(154, ChildPanelY(78), "Pause", primary);
            tft.drawRect(160, ChildPanelY(22), 79 + 4, 36, surface);
            tft.drawRect(150, ChildPanelY(74), 100 + 4, 36, primary);
            tft.drawRect(163, ChildPanelY(126), 73 + 4, 36, surface);
          } else if (Paused() || NotRunning()) {
            TFTPrint(164, ChildPanelY(26), "Start", primary);
            TFTPrint(154, ChildPanelY(78), "Pause", surfaceVariant);
            tft.drawRect(160, ChildPanelY(22), 79 + 4, 36, primary);
            tft.drawRect(150, ChildPanelY(74), 100 + 4, 36, surface);
            tft.drawRect(163, ChildPanelY(126), 73 + 4, 36, surface);
            
          }
        } else if (GUI.actionSelectionY == 1){
          tft.drawRect(160, ChildPanelY(22), 79 + 4, 36, surface);
          tft.drawRect(150, ChildPanelY(74), 100 + 4, 36, surface);
          tft.drawRect(157, ChildPanelY(126), 77 + 9, 36, primary);
          
        }

        
        
        
        tft.setFont(&FreeSans12pt7b);
        // RectWithCenteredText(true, )

      } else if (AtLightScreen()){
        
        if(GUI.lightSelectionX == 0){
          tft.fillRect((ChildPanelX((childPanelWidth / 4) - 40)), ChildPanelY((childPanelHeight / 2) - 40), 80, 80, primaryContainer);
          TFTPrint((lightHour >= 10 ? 112 : 128), 133, std::to_string(lightHour).c_str(), onPrimaryContainer, 2);
          
          tft.fillRect(ChildPanelX((childPanelWidth / 4 * 3) - 40), ChildPanelY((childPanelHeight / 2) - 40), 80, 80, surface);
          tft.drawRect(ChildPanelX((childPanelWidth / 4 * 3) - 40), ChildPanelY((childPanelHeight / 2) - 40), 80, 80, primaryContainer);
          TFTPrint((darkHour >= 10 ? 232 : 248), 133, std::to_string(darkHour).c_str(), primaryContainer, 2);
        } else if (GUI.lightSelectionX == 1) {
          tft.fillRect(ChildPanelX((childPanelWidth / 4) - 40), ChildPanelY((childPanelHeight / 2) - 40), 80, 80, surface);
          tft.drawRect(ChildPanelX((childPanelWidth / 4) - 40), ChildPanelY((childPanelHeight / 2) - 40), 80, 80, primaryContainer);
          TFTPrint((lightHour >= 10 ? 112 : 128), 133, std::to_string(lightHour).c_str(), primaryContainer, 2);
          
          tft.fillRect(ChildPanelX((childPanelWidth / 4 * 3) - 40), ChildPanelY((childPanelHeight / 2) - 40), 80, 80, primaryContainer);
          TFTPrint((darkHour >= 10 ? 232 : 248), 133, std::to_string(darkHour).c_str(), onPrimaryContainer, 2);
        }
        
        
        if (xTaskNotifyWait(0, 0xFFFFFFFF, &ulNotificationValue, portMAX_DELAY) == pdTRUE) {
          
        }
      } else if (AtSensorScreen()){
        tft.setTextColor(onSurface, surface);
        tft.fillRect(53, 81, 50, 22, surface);
        tft.getTextBounds(String(pH_Val), 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
        tft.setCursor(54, 100);
        tft.print(pH_Val);
        // tft.setCursor(87, 126);
        tft.fillRect(86, 126, 60, 22, surface);
        tft.setCursor(87, 144);
        tft.getTextBounds(String(waterLevel), 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
        tft.print(waterLevel);tft.print(" %");
        // tft.setCursor(84, 171);
        tft.fillRect(83, 171, 60, 22, surface);
        tft.setCursor(84, 190);
        tft.getTextBounds(String(dhtTemp), 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
        tft.print(dhtTemp);tft.print(char(248));tft.println("C");
        // tft.setCursor(228, 81);
        tft.setCursor(198, 100);
        tft.getTextBounds(String(tdsValue), 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
        tft.print(tdsValue);
        tft.fillRect(tft.getCursorX(), 81, 60, 22, surface);
        tft.print(" ppm");
        // tft.setCursor(232, 126);
        tft.fillRect(231, 126, 60, 22, surface);
        tft.setCursor(232, 126);
        tft.getTextBounds(String(dhtHumid), 0, 0, &xBuf, &yBuf, &wBuf, &hBuf);
        tft.print(dhtHumid);tft.print(" %");
        // tft.setCursor(247, 171);
        tft.fillRect(246, 171, 60, 22, surface);
      } else if (AtPumpScreen()){
        tft.setTextColor(onSurface, surface);
        // tft.setCursor(54, 81);
        tft.fillRect(83, 81, 50, 22, surface);
        tft.setCursor(84, 100);
        tft.print((waterPumpState ? "ON" : "OFF"));
        // tft.setCursor(87, 126);
        tft.fillRect(86, 126, 50, 22, surface);
        tft.setCursor(87, 144);
        tft.print((drainPumpState ? "ON" : "OFF"));
        // tft.setCursor(84, 171);
        tft.fillRect(83, 171, 60, 22, surface);
        tft.setCursor(84, 190);
        tft.print((servoState ? "ON" : "OFF"));
        // tft.setCursor(228, 81);
        tft.fillRect(227, 81, 60, 22, surface);
        tft.setCursor(228, 100);
        tft.print((airPumpState ? "ON" : "OFF"));
        // tft.setCursor(232, 126);
        tft.fillRect(231, 126, 60, 22, surface);
        tft.setCursor(232, 144);
        tft.print((growLightState ? "ON" : "OFF"));
        // tft.setCursor(247, 171);
        tft.fillRect(246, 171, 60, 22, surface);
        tft.setCursor(247, 190);
        tft.print((humidifierState ? "ON" : "OFF"));
      }
      xSemaphoreGive(xTFTPrintMutex);
      vTaskDelay(250 / portTICK_PERIOD_MS);
    }
    vTaskDelay(20/ portTICK_PERIOD_MS);
  }
}

