woddu/ESP32S3-Hydroponics/src/hydroponics.h
void Joystick(void * param){

  int prevX, prevY;
  int currX, currY;
  unsigned long prevMil, printM;
  while(1){
    if(xSemaphoreTake(xADSMutex, portMAX_DELAY) == pdTRUE){
      ads2 = ads.readADC_SingleEnded(2);
      ads3 = ads.readADC_SingleEnded(3);
      volt2 = ads.computeVolts(ads2);
      volt3 = ads.computeVolts(ads3);
      xSemaphoreGive(xADSMutex);
    }
    prevX = currX;
    prevY = currY;
    currX = ads2;
    currY = ads3;
    
    if (millis() - printM >= 500){
      printM = millis();
      Serial0.printf("x: %d, y: %d\n", ads2, ads3);
    }

    if (millis() - prevMil >= 1000 && (AtSensorScreen() || AtPumpScreen())){
      prevMil = millis();
      xTaskNotifyGive(xTFTChildPanelHandle);
    }

    if(prevX >= 200 && currX < 200){  // Right
      if (AtMainScreen()){
        LeftPanelEnter();
        
      } else if (AtActionScreen()){
        // Actions
        if(GUI.actionSelectionY == 0){
          if(Started()){
            GUI.actionSelectionY == 0;
            pauseAttempt = true;
            LeftPanelBack();
          } else if (Paused() || NotRunning()) {
            // if there is water
            GUI.actionSelectionY == 0;
            startAttempt = true;
            LeftPanelBack();
          }
        } else {
          if(Draining()){
            Serial0.println("Stopping Drain");
            GUI.actionSelectionY == 0;
            draining = false;
            LeftPanelBack();
            pNotifyLogs->setValue(LOG_DRAINING_STOP);
            pNotifyLogs->notify();
          } else {
            Serial0.println("Starting Drain");
            GUI.actionSelectionY == 0;
            drainAttempt = true;
            LeftPanelBack();
          }
        }
        xTaskNotifyGive(xTFTChildPanelHandle);
      } else if (AtLightScreen()){
        GUI.lightSelectionX = 1;
        xTaskNotifyGive(xTFTChildPanelHandle);
      } else if (AtSensorScreen()){
  
      }
    } else if(prevX <= 900 && currX > 900){ // Left
      if (AtActionScreen()){
        xTaskNotifyGive(xTFTChildPanelHandle);
        LeftPanelBack();
      } else if (AtLightScreen()){
        if (GUI.lightSelectionX == 0) {
          xTaskNotifyGive(xTFTChildPanelHandle);
          LeftPanelBack();
        } else if(GUI.lightSelectionX == 1){
          GUI.lightSelectionX = 0;
          xTaskNotifyGive(xTFTChildPanelHandle);
        }
      } else if (AtSensorScreen()){
        LeftPanelBack();
        xTaskNotifyGive(xTFTLeftPanelHandle);
      } else if (AtPumpScreen()){
        LeftPanelBack();
        xTaskNotifyGive(xTFTLeftPanelHandle);
      }
    }

    if(prevY <= 900 && currY > 900){// Down
      if (AtMainScreen()){
        LeftPanelDown();
        xTaskNotifyGive(xTFTLeftPanelHandle);
      } else if (AtActionScreen()){
        GUI.actionSelectionY = 1;
        xTaskNotifyGive(xTFTChildPanelHandle);
      } else if (AtLightScreen()){
        if (GUI.lightSelectionX == 0) {
          lightHour = (lightHour <= 12 ? 12 : lightHour - 1);
          darkHour = 24 - lightHour;
          // pref.begin("iQuaRoots");
          // pref.putInt("LightHour", lightHour);
          // pref.putInt("DarkHour", darkHour);
          // pref.end();
          xTaskNotifyGive(xTFTChildPanelHandle);
        } else if(GUI.lightSelectionX == 1){
          darkHour = (darkHour <= 0 ? 0 : darkHour - 1);
          lightHour = 24 - darkHour;
          // pref.begin("iQuaRoots");
          // pref.putInt("LightHour", lightHour);
          // pref.putInt("DarkHour", darkHour);
          // pref.end();
          xTaskNotifyGive(xTFTChildPanelHandle);
        }
      } else if (AtSensorScreen()){
        
      } else if (AtPumpScreen()){
        
      }
    } else if(prevY >= 200 && currY < 200){// Up
      if (AtMainScreen()){
        LeftPanelUp();
        xTaskNotifyGive(xTFTLeftPanelHandle);
      } else if (AtActionScreen()){
        GUI.actionSelectionY = 0;
        xTaskNotifyGive(xTFTChildPanelHandle);
      } else if (AtLightScreen()){
        if (GUI.lightSelectionX == 0) {
          lightHour = (lightHour >= 24 ? 24 : lightHour + 1);
          darkHour = 24 - lightHour;
          // pref.begin("iQuaRoots");
          // pref.putInt("LightHour", lightHour);
          // pref.putInt("DarkHour", darkHour);
          // pref.end();
          xTaskNotifyGive(xTFTChildPanelHandle);
        } else if(GUI.lightSelectionX == 1){
          darkHour = (darkHour >= 12 ? 12 : darkHour + 1);
          lightHour = 24 - darkHour;
          // pref.begin("iQuaRoots");
          // pref.putInt("LightHour", lightHour);
          // pref.putInt("DarkHour", darkHour);
          // pref.end();
          xTaskNotifyGive(xTFTChildPanelHandle);
        }
      } else if (AtSensorScreen()){
        
      } else if (AtPumpScreen()){
        
      }
    }

    vTaskDelay(5 / portTICK_PERIOD_MS);
  }
}